
    {
    'text_vec': tensor([[ 5281,  3980,     7,     5,  5183,     8,  6001,  3980,  1417,  3980,     3251,     9,   419,  1653,     7,    60,    44,  1375, 34443,   650,    111,   640,     6,     6,     6, 49816, 36544,   111,   288,    42, 757]], device='cuda:0'), 
    'text_lengths': [31], 
    'label_vec': tensor([[   49,  2297,    53,     8,     5,    86,    21,    27,    55,   143,   17548,   144,     5,   289,   586,   113,     2]], device='cuda:0'), 
    'label_lengths': [17], 
    'labels': ["its actually one of the world's most popular hobbies since the late 19th century"], 
    'valid_indices': (0,), 
    'candidates': None, 
    'candidate_vecs': None, 
    'image': None, 
    'observations': 
    ({
        'id': 'wizard_of_wikipedia', 
        'text': 'Stamp collecting\nthe hobby of stamp collecting involves collecting stamps and related objects\nI have always wondered how this works... grabbing popcorn this will be good', 
        'chosen_topic': 'Stamp collecting', 
        'episode_done': False, 
        'label_candidates': ['THey sure our little theives they always hide stuff under the furniture.', 'So you are a gamer?', 'What fair do you go to? I love a corn dog deep fried with a thick layer of batter.', 'I think earl gray is the best in my opinion', 'I love to eat vegetarian', 'No! But I understand the intricacies of raising a child to adulthood! They go through so much. ', 'I use to always want a Siberian Husky when I was younger they are so beautiful. ', "Cal's the best! A 19-time All-Star! ", 'Every species has the ability to regenerate cells, but not sure how advanced scientists are on humans rather than other animals or bacteria at this point.', "I'm not sure. Casualty takes the british medical drama takes place in Holby City.", 'No, but it really does sound fun. One of my friends went to Caesars Palace and had the greatest time at the casino.', "Specifically, no, but French cuisine, and Paris in particular, offers some of the finest food in the world, and that's why it entices so many travelers every year. This helped Paris, according to 2013-2014 official estimates, have the third-highest GDP in the world, and the largest regional GDP in the EU, because of its tourism.", 'Ah how rare! Where might you be from, as they are kept in the US, Canada, Germany, the Netherlands, Poland and Italy?', "That's true! I never thought about that! What do you think the best place is to watch the sun come up?", "The Bible is my favorite book. It's pretty old, but it has some very interesting stories.", 'Are there categories of it?', 'I am pretty sure my favorite was the end of the day', 'Definitely. Most likely why the proportion of families with only children increased during the Great Depression.', 'Depending on where you live, divorce laws can be different. ', 'That seems like really hard work, actually having to use your hands and build stuff.', 'Pizza can also be topped with additional vegetables, meats, and condiments,without cheese', 'well the particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, or cobblestones.', 'Sounds like a great time! I bet its a sugar filled wonderland.', 'hmm well do you know perhaps where he was born?', 'I suppose so. I wonder if there are any strange or weird things about it. Or anything particularly unusual about it', 'A factory is a manufacturing plant', 'Exactly!  They were originally built in Flint, Michigan and St. Louis, Missouri, but now they are built in Bowling Green, Kentucky.', 'Well the British cooking writer Elizabeth David uses it in a section called Soft Biscuits. Then has bread and tea cakes in a different part, so there is another meaning.', "It's great! The original formula was invented in 1940.", 'I do too. Too much makeup looks unpleasant to me.', 'What is the origin of the golden retriever?', 'Iron Man is science fiction.  There are no silly questions.  Do you know when science fiction books started to become popular?', 'do you know flower sometimes known as a bloom or blossom ', "its actually one of the world's most popular hobbies since the late 19th century", 'I enjoy swimming and it is consistently one of the top public recreational activities ', "Yes they do! Pets are so great! I use mine for company and entertainment, but some can also be used for protection! I'd love to have a guard dog!", 'I havent but my husband has and he loved it.  I read that the term "Pizza" was first recorded in the 10th century in a Latin manuscript from the Southern Itally town of Gaeta in Lazio', 'I usually go to the VIP areas and hang out with celebrities.', 'That would make sense. thanks for the info!', 'Exactly, they sold more than 150 million units as of September 2013. SO imagine how much money they make!', 'Well The current version, a daily syndicated show produced by Sony Pictures Television.', 'My cat seems really intelligent', 'I played Mario Kart a few times with my kids when they were younger on our Wii.', 'It would be the absense of aging, but some say it may not mean your immune to disease or physical trauma.', 'Have you been a farmer since then?', "That's when they hope around like little idoits and play fight. I think the purpose in the wild is that they confuse their prey.", 'What does sweet water produce?', 'Indeed. There are animal ingredients even in things like processed foods and candy', "That's what I imagine when I think of pipe smoking as well, native americans in teepees. ", 'Cut refers to meat attached to the bones, but can also include organ meat', "I don't have a problem with metal bands, for whatever reason Korn just wasn't for me. They were for formed by 3 members of the band L.A.P.D", 'Hi there! what are some of your favorite hobbies?', "I forgot already. it was in the 1930's and 1940's. How about Donald Heck? He's known for his comic series The Avengers", 'It was popular in England back in the 19th century and became popular over here in the 30s.', 'Do you mean America originally belongs to the Indians?', 'Uh Huh is an indie/rock/electropop band that was formed in January 2007 .', 'You could always focus on maybe gaming or making mobile apps? There is a gaming company called Oddworld Inhabitants that might be hiring!', "I don't know what I've been missing by not eating steak sooner in my life. I love that there are so many different kinds of cuts of steak to enjoy, too! Skirt steak, flank steak, silverfinger steak.. I have much to catch up on.", "I love pizza! It's my FAVORITE food.", 'I love eating Bagels!  My favorite are blueberry bagels!  Do you enjoy them?', "Ah, I see. Well, from your experience, what else do you know about it? Any famous bank tellers? Anything they do that's really intricate and hard?", "I teach Vinyasa and Hatha. I don't know if I'm special, just had a good opportunity to learn, and good teachers! ", 'Definitely, it seems a long and tedious process.', "That sounds awesome. I like all dogs, I heard pit bulls and bull dogs are loyal dogs, might get territorial as well. Not for everyone but they're sweet.", "Me too, it's so beautiful, and the same with like an ocean blue, it's so soothing.", "I happen to have blue eyes myself. I didn't know about Tyndall effect, what is it?", 'So what do you know about the endemic ,especially in sub Saharan region?', 'I figured things would get a lot harder for people who collected stamps, I mean it makes sense.. What are some of your favorite stamps?', 'I will have to look up bullenbeisser. I have never heard of that breed!', 'Arsenal F.C. is my favorite football club, are you watching the World Cup?', "You're so lucky! Can you elaborate on the Tyndall effect?", 'Ross was an American painter and television host', 'I guess it is OK to hoard up a certain limit. Then it becomes more trouble than good.', 'Please tell  more', 'General understanding of others is the key for me.', 'I really love Aristotle! I love to ponder questions like, Is it possible to know anything and to prove it? ', "I wonder if it's referring to seperation of reality vs imagination rather than an actual state", 'I support their cause but think their methods can be harmful. How big of an organization is PETA?', 'The version of pizza we know was invented in Naples', 'Those books are awesome!  Jacob and Wilhelm Grimm were so talented!  I also like the tv show called Grimm that was based on their stories!', "Yes but it wasn't until the end of the 20th century that the stigmas of tattoes  were dismissed  and it became an acceptable practice for everyone.", "That's a fair point. They're still useful in today's world, as they're used by disc jockeys and listened to by niche market audiophiles, possibly like you", 'Ahh..  How hard is it to meet a balanced protein need within the diet?', 'Pizza is favorite food for me too it is delicious and Italian food too ', 'okay, the name rollerblade is just the tradename for inline skates, I got it know', 'Well, I guess maybe I should start thinking of New York as more than just New York City. Syracuse sounds interesting.', "American Idol is all about finding unsigned singers future recording starts and it's the public that votes by SMS and the Internet.", 'Florida is such a diverse state with so many climates', "I think it's socially accepted as a sport but not as a mode of transportation.  I doubt that it is even legal to use a board on the sidewalk.", 'No I doubt it. I do know a few that got full scholarships to college though.', 'That sounds cool! Are their a lot of different kinds of Parrots?', "I just love giant pandas - they're so beautiful. I wish I could see one in the wild.", 'Im a John Lennon guy myself, tragic what happened to him, sadly we have some sick and twisted people in this world.', "That's really awesome are you close to being the star she was?", 'Commercial aviation is a massive industry involving the flying of tens of thousands of passengers daily ', 'i love grey wolves! grey is my favorite color', "It's seems amazing. It was formed by volcanic activity which is brilliant in itself..", "Not surprising, considering Las Vegas is one of the world's most visited tourist destinations!", 'Is that how they started out?', 'Correct they moved. There is still a Canadian basketball team though. Called the Toronto Raptors.'], 
        'knowledge': 'Stamp collecting Stamp collecting is the collecting of postage stamps and related objects.\nStamp collecting It is related to philately which is the study of stamps.\nStamp collecting It has been one of the world\'s most popular hobbies since the late nineteenth century with the rapid growth of the postal service.\nStamp collecting Stamp collecting proved to be an almost perfect hobby for collectors because there was a never ending stream of new stamps as each country sought to advertise its distinctiveness through its stamps.\nStamp collecting Stamp collecting is generally accepted as one of the areas that make up the wider subject of philately, which is the study of stamps.\nStamp collecting A philatelist may, but does not have to, collect stamps.\nStamp collecting It is not uncommon for the term "philatelist" to be used to mean a stamp collector.\nStamp collecting Many casual stamp collectors accumulate stamps for sheer enjoyment and relaxation without worrying about the tiny details.\nStamp collecting The creation of a large or comprehensive collection, however, generally requires some philatelic knowledge and will usually contain areas of philatelic studies.\nStamp collecting Postage stamps are often collected for their historical value and geographical aspects and also for the many subjects depicted on them, ranging from ships, horses, and birds to kings, queens and presidents.\nPopcorn Popcorn, or pop corn, is a variety of corn kernel, which forcefully expands and puffs up when heated.\nPopcorn A popcorn kernel\'s strong hull contains the seed\'s hard, starchy endosperm with 14-20% moisture, which turns to steam as the kernel is heated.\nPopcorn The pressure continues building until it exceeds the hull\'s ability to contain it.\nPopcorn The kernel ruptures and forcefully expands, allowing the contents to expand, cool, and finally set in a popcorn puff 20 to 50 times the size of the original kernel.\nPopcorn Some strains of corn (taxonomized as "Zea mays") are cultivated specifically as popping corns.\nPopcorn The "Zea mays" variety "everta," a special kind of flint corn, is the most common of these.\nPopcorn Time Popcorn Time is a multi-platform, free software BitTorrent client that includes an integrated media player.\nPopcorn Time The applications provide a free alternative to subscription-based video streaming services such as Netflix.\nPopcorn Time Popcorn Time uses sequential downloading to stream video listed by several torrent websites, and third party trackers can also be added manually.\nPopcorn Time Following its inception, Popcorn Time quickly received positive media attention, with some comparing the app to Netflix for being easy to use.\nPopcorn Time After this increase in popularity, the program was abruptly taken down by its original developers on March 14, 2014, due to pressure from the MPAA.\nTiny but Mighty Popcorn Tiny but Mighty Popcorn is an American brand of heirloom popcorn, introduced in 1981, when Iowa farmer Richard Kelty founded K&K Popcorn.\nTiny but Mighty Popcorn Iowa farmers Gene and Lynn Mealhow later purchased the company in 1999, and subsequently renamed it.\nTiny but Mighty Popcorn Since 1854, the ancestors of Richard Kelty (1936-2015) had been growing a heirloom popcorn variety out of small kernels, whose hulls would disintegrate after being popped, resulting in a richer taste.\nTiny but Mighty Popcorn The popcorn had been introduced to the Kelty family by Native Americans, who shared it with them.\nTiny but Mighty Popcorn The Kelty family had never sold the popcorn, which was only grown for personal consumption.\nList of Madagascar (franchise) characters This is a list of characters that have appeared in the "Madagascar" films, the television series "The Penguins of Madagascar", and the Netflix series "All Hail King Julien".\nList of Madagascar (franchise) characters Tom McGrath explained in an interview that the intention of "Madagascar" was not to take a political stance on whether "zoos are bad and the wild is better, or that the wild is bad," but to show "the most extreme \'fish out of water\' story that [they] could do".\nList of Madagascar (franchise) characters McGrath stated "the basic irony to the story is that, you think animals do belong in the wild, but if they\'re so accustomed to civility, they wouldn\'t know where food even came from," and the animals were meant to "love the zoo and to love where they are because they\'ve got" "right off Fifth Avenue".\nMe² "Me²" (pronounced "me, squared") is the sixth and final episode from series one of the science fiction sitcom "Red Dwarf", which was first broadcast on BBC2 on 21 March 1988.\nMe² Written by Rob Grant and Doug Naylor, and directed by Ed Bye.\nMe² The script was written, as a late addition to the series, following an electrician\'s strike at the BBC.\nMe² The episode follows on from the cliffhanger set by "Confidence and Paranoia" - there are now two Rimmers on board "Red Dwarf".\nMe² The episode was remastered, along with the rest of the first three series\', in 1998, to bring the episode up to a standard suitable for international broadcast.\nList of Bakugan Battle Brawlers characters This is a list of characters from the Japanese anime series "Bakugan Battle Brawlers".\nList of Bakugan Battle Brawlers characters Daniel "Dan" Kuso (known in the Japanese version as is the main human protagonist in the series, who, is 12 years old in the first season, 15 in New Vestroia, 16 in Gundalian Invaders, and 17 in Mechtanium Surge.\nList of Bakugan Battle Brawlers characters In the beginning he is ranked #121, and by episode 39, he is ranked #1, and has become ranked #4 or under in episode 6 of Mechtanium Surge.\nList of Bakugan Battle Brawlers characters In "New Vestroia", Dan returns to New Vestroia to help Drago save the world from the invading Vestals.\nList of Bakugan Battle Brawlers characters Despite having just been introduced to the new Brawling system, Dan manages to get the hang of it before he battles his way into the Resistance by tying with Ace.\nPopcorn maker A popcorn maker (also called a popcorn popper) is a machine used to pop popcorn.\nPopcorn maker Since ancient times, popcorn has been a popular snack food, produced through the explosive expansion of kernels of heated corn (maize).\nPopcorn maker Commercial large scale popcorn machines were invented by Charles Cretors in the late 19th century.\nPopcorn maker Many types of small scale home methods for popping corn also exist.\nPopcorn maker Commercial popcorn machines are commonly found in movie theaters and carnivals, producing popcorn in a pan of hot oil, which has approximately 45% of its calories derived from fat.\nPopcorn maker Hot air popcorn poppers appeared for home use in the late 1970s, which produce popcorn with only 5% of its calories derived from fat.\nPostage stamp A postage stamp is a small piece of paper that is purchased and displayed on an item of mail as evidence of payment of postage.\nPostage stamp Typically, stamps are printed on special custom-made paper, show a national designation and a denomination (value) on the front, and have an adhesive gum on the back or are self-adhesive.\nPostage stamp Postage stamps are purchased from a postal administration (post office) or other authorized vendor, and are used to pay for the costs involved in moving mail, as well as other business necessities such as insurance and registration.\nPostage stamp They are sometimes a source of net profit to the issuing agency, especially when sold to collectors who will not actually use them for postage.\nTrading stamp culture in Hong Kong Stamp collection is a common practice among retail outlets in Hong Kong.\nTrading stamp culture in Hong Kong The concept is to allow customers to redeem free gifts or shopping discounts after purchase.\nTrading stamp culture in Hong Kong The general mechanism is that stamps will be given to customers when their single purchase exceeds a certain amount of money.\nTrading stamp culture in Hong Kong Usually, the number of stamps given to customers is directly proportional to the money they spend on that purchase.\nTrading stamp culture in Hong Kong The more they spend, the more stamps they get.\nTrading stamp culture in Hong Kong Then, customers can stick the stamps on the collection booklet provided by the shop.\nTrading stamp culture in Hong Kong When they have collected certain amount of stamps, they can redeem products or chances to take part in some activities like lucky draws.\nHobby A hobby is a regular activity that is done for enjoyment, typically during one\'s leisure time.\nHobby Hobbies can include collecting themed items and objects, engaging in creative and artistic pursuits, playing sports, or pursuing other amusements.\nHobby A list of hobbies is lengthy and always changing as interests and fashions change.\nHobby By continually participating in a particular hobby, one can acquire substantial skills and knowledge in that area.\nHobby Engagement in hobbies has increased since the late nineteenth century as workers have more leisure time and advancing production and technology have provided more support for leisure activities.\nFederal Duck Stamp The Federal Duck Stamp, formally known as the Migratory Bird Hunting and Conservation Stamp, is an adhesive stamp issued by the United States federal government that must be purchased prior to hunting for migratory waterfowl such as ducks and geese.\nFederal Duck Stamp It is also used to gain entrance to National Wildlife Refuges that normally charge for admission.\nFederal Duck Stamp It is widely seen as a collectable and a means to raise funds for wetland conservation, with 98% of the proceeds of each sale going to the Migratory Bird Conservation Fund.\nFederal Duck Stamp President Herbert Hoover signed the Migratory Bird Conservation Act in 1929 to authorize the acquisition and preservation of wetlands as waterfowl habitat.\nPostage stamps of Ireland The postage stamps of Ireland are issued by the postal operator of the independent Irish state.\nPostage stamps of Ireland Ireland was part of the United Kingdom of Great Britain and Ireland when the world\'s first postage stamps were issued in 1840.\nPostage stamps of Ireland These stamps, and all subsequent British issues, were used in Ireland until the new Irish Government assumed power in 1922.\nPostage stamps of Ireland Beginning on 17 February 1922, existing British stamps were overprinted with Irish text to provide some definitives until separate Irish issues became available.\nPostage stamps of Ireland Following the overprints, a regular series of definitive stamps was produced by the new Department of Posts and Telegraphs, using domestic designs.\nPenny Red The Penny Red was a British postage stamp, issued in 1841.\nPenny Red It succeeded the Penny Black and continued as the main type of postage stamp in the United Kingdom of Great Britain and Ireland until 1879, with only minor changes to the design during that time.\nPenny Red The colour was changed from black to red because of difficulty in seeing a cancellation mark on the Penny Black; a black cancel was readily visible on a Penny Red.\nPenny Red Initially, some of the same plates that were used to print the Penny Black were used to print the Penny Red and about 21 billion Penny Reds were printed by Messrs. Perkins, Bacon & Co.\n', 
        'title': 'Stamp collecting', 
        'checked_sentence': "It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.", 
        評価？knowledgeに入ってる'eval_labels': ["its actually one of the world's most popular hobbies since the late 19th century"], 
        'text_vec': tensor([ 5281,  3980,     7,     5,  5183,     8,  6001,  3980,  1417,  3980,   3251,     9,   419,  1653,     7,    60,    44,  1375, 34443,   650,    111,   640,     6,     6,     6, 49816, 36544,   111,   288,    42, 757]), 
        'eval_labels_vec': tensor([   49,  2297,    53,     8,     5,    86,    21,    27,    55,   143,    17548,   144,     5,   289,   586,   113,     2]), 
        'eval_labels_choice': "its actually one of the world's most popular hobbies since the late 19th century", 
        'knowledge_parsed': ["Stamp collecting __knowledge__ It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.", 'Stamp collecting It is related to philately which is the study of stamps.', "Stamp collecting It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.", 'Stamp collecting Stamp collecting proved to be an almost perfect hobby for collectors because there was a never ending stream of new stamps as each country sought to advertise its distinctiveness through its stamps.', 'Stamp collecting Stamp collecting is generally accepted as one of the areas that make up the wider subject of philately, which is the study of stamps.', 'Stamp collecting A philatelist may, but does not have to, collect stamps.', 'Stamp collecting It is not uncommon for the term "philatelist" to be used to mean a stamp collector.', 'Stamp collecting Many casual stamp collectors accumulate stamps for sheer enjoyment and relaxation without worrying about the tiny details.', 'Stamp collecting The creation of a large or comprehensive collection, however, generally requires some philatelic knowledge and will usually contain areas of philatelic studies.', 'Stamp collecting Postage stamps are often collected for their historical value and geographical aspects and also for the many subjects depicted on them, ranging from ships, horses, and birds to kings, queens and presidents.', 'Popcorn Popcorn, or pop corn, is a variety of corn kernel, which forcefully expands and puffs up when heated.', "Popcorn A popcorn kernel's strong hull contains the seed's hard, starchy endosperm with 14-20% moisture, which turns to steam as the kernel is heated.", "Popcorn The pressure continues building until it exceeds the hull's ability to contain it.", 'Popcorn The kernel ruptures and forcefully expands, allowing the contents to expand, cool, and finally set in a popcorn puff 20 to 50 times the size of the original kernel.', 'Popcorn Some strains of corn (taxonomized as "Zea mays") are cultivated specifically as popping corns.', 'Popcorn The "Zea mays" variety "everta," a special kind of flint corn, is the most common of these.', 'Popcorn Time Popcorn Time is a multi-platform, free software BitTorrent client that includes an integrated media player.', 'Popcorn Time The applications provide a free alternative to subscription-based video streaming services such as Netflix.', 'Popcorn Time Popcorn Time uses sequential downloading to stream video listed by several torrent websites, and third party trackers can also be added manually.', 'Popcorn Time Following its inception, Popcorn Time quickly received positive media attention, with some comparing the app to Netflix for being easy to use.', 'Popcorn Time After this increase in popularity, the program was abruptly taken down by its original developers on March 14, 2014, due to pressure from the MPAA.', 'Tiny but Mighty Popcorn Tiny but Mighty Popcorn is an American brand of heirloom popcorn, introduced in 1981, when Iowa farmer Richard Kelty founded K&K Popcorn.', 'Tiny but Mighty Popcorn Iowa farmers Gene and Lynn Mealhow later purchased the company in 1999, and subsequently renamed it.', 'Tiny but Mighty Popcorn Since 1854, the ancestors of Richard Kelty (1936-2015) had been growing a heirloom popcorn variety out of small kernels, whose hulls would disintegrate after being popped, resulting in a richer taste.', 'Tiny but Mighty Popcorn The popcorn had been introduced to the Kelty family by Native Americans, who shared it with them.', 'Tiny but Mighty Popcorn The Kelty family had never sold the popcorn, which was only grown for personal consumption.', 'List of Madagascar (franchise) characters This is a list of characters that have appeared in the "Madagascar" films, the television series "The Penguins of Madagascar", and the Netflix series "All Hail King Julien".', 'List of Madagascar (franchise) characters Tom McGrath explained in an interview that the intention of "Madagascar" was not to take a political stance on whether "zoos are bad and the wild is better, or that the wild is bad," but to show "the most extreme \'fish out of water\' story that [they] could do".', 'List of Madagascar (franchise) characters McGrath stated "the basic irony to the story is that, you think animals do belong in the wild, but if they\'re so accustomed to civility, they wouldn\'t know where food even came from," and the animals were meant to "love the zoo and to love where they are because they\'ve got" "right off Fifth Avenue".', 'Me² "Me²" (pronounced "me, squared") is the sixth and final episode from series one of the science fiction sitcom "Red Dwarf", which was first broadcast on BBC2 on 21 March 1988.', 'Me² Written by Rob Grant and Doug Naylor, and directed by Ed Bye.', "Me² The script was written, as a late addition to the series, following an electrician's strike at the BBC.", 'Me² The episode follows on from the cliffhanger set by "Confidence and Paranoia" - there are now two Rimmers on board "Red Dwarf".', "Me² The episode was remastered, along with the rest of the first three series', in 1998, to bring the episode up to a standard suitable for international broadcast.", 'List of Bakugan Battle Brawlers characters This is a list of characters from the Japanese anime series "Bakugan Battle Brawlers".', 'List of Bakugan Battle Brawlers characters Daniel "Dan" Kuso (known in the Japanese version as is the main human protagonist in the series, who, is 12 years old in the first season, 15 in New Vestroia, 16 in Gundalian Invaders, and 17 in Mechtanium Surge.', 'List of Bakugan Battle Brawlers characters In the beginning he is ranked #121, and by episode 39, he is ranked #1, and has become ranked #4 or under in episode 6 of Mechtanium Surge.', 'List of Bakugan Battle Brawlers characters In "New Vestroia", Dan returns to New Vestroia to help Drago save the world from the invading Vestals.', 'List of Bakugan Battle Brawlers characters Despite having just been introduced to the new Brawling system, Dan manages to get the hang of it before he battles his way into the Resistance by tying with Ace.', 'Popcorn maker A popcorn maker (also called a popcorn popper) is a machine used to pop popcorn.', 'Popcorn maker Since ancient times, popcorn has been a popular snack food, produced through the explosive expansion of kernels of heated corn (maize).', 'Popcorn maker Commercial large scale popcorn machines were invented by Charles Cretors in the late 19th century.', 'Popcorn maker Many types of small scale home methods for popping corn also exist.', 'Popcorn maker Commercial popcorn machines are commonly found in movie theaters and carnivals, producing popcorn in a pan of hot oil, which has approximately 45% of its calories derived from fat.', 'Popcorn maker Hot air popcorn poppers appeared for home use in the late 1970s, which produce popcorn with only 5% of its calories derived from fat.', 'Postage stamp A postage stamp is a small piece of paper that is purchased and displayed on an item of mail as evidence of payment of postage.', 'Postage stamp Typically, stamps are printed on special custom-made paper, show a national designation and a denomination (value) on the front, and have an adhesive gum on the back or are self-adhesive.', 'Postage stamp Postage stamps are purchased from a postal administration (post office) or other authorized vendor, and are used to pay for the costs involved in moving mail, as well as other business necessities such as insurance and registration.', 'Postage stamp They are sometimes a source of net profit to the issuing agency, especially when sold to collectors who will not actually use them for postage.', 'Trading stamp culture in Hong Kong Stamp collection is a common practice among retail outlets in Hong Kong.', 'Trading stamp culture in Hong Kong The concept is to allow customers to redeem free gifts or shopping discounts after purchase.', 'Trading stamp culture in Hong Kong The general mechanism is that stamps will be given to customers when their single purchase exceeds a certain amount of money.', 'Trading stamp culture in Hong Kong Usually, the number of stamps given to customers is directly proportional to the money they spend on that purchase.', 'Trading stamp culture in Hong Kong The more they spend, the more stamps they get.', 'Trading stamp culture in Hong Kong Then, customers can stick the stamps on the collection booklet provided by the shop.', 'Trading stamp culture in Hong Kong When they have collected certain amount of stamps, they can redeem products or chances to take part in some activities like lucky draws.', "Hobby A hobby is a regular activity that is done for enjoyment, typically during one's leisure time.", 'Hobby Hobbies can include collecting themed items and objects, engaging in creative and artistic pursuits, playing sports, or pursuing other amusements.', 'Hobby A list of hobbies is lengthy and always changing as interests and fashions change.', 'Hobby By continually participating in a particular hobby, one can acquire substantial skills and knowledge in that area.', 'Hobby Engagement in hobbies has increased since the late nineteenth century as workers have more leisure time and advancing production and technology have provided more support for leisure activities.', 'Federal Duck Stamp The Federal Duck Stamp, formally known as the Migratory Bird Hunting and Conservation Stamp, is an adhesive stamp issued by the United States federal government that must be purchased prior to hunting for migratory waterfowl such as ducks and geese.', 'Federal Duck Stamp It is also used to gain entrance to National Wildlife Refuges that normally charge for admission.', 'Federal Duck Stamp It is widely seen as a collectable and a means to raise funds for wetland conservation, with 98% of the proceeds of each sale going to the Migratory Bird Conservation Fund.', 'Federal Duck Stamp President Herbert Hoover signed the Migratory Bird Conservation Act in 1929 to authorize the acquisition and preservation of wetlands as waterfowl habitat.', 'Postage stamps of Ireland The postage stamps of Ireland are issued by the postal operator of the independent Irish state.', "Postage stamps of Ireland Ireland was part of the United Kingdom of Great Britain and Ireland when the world's first postage stamps were issued in 1840.", 'Postage stamps of Ireland These stamps, and all subsequent British issues, were used in Ireland until the new Irish Government assumed power in 1922.', 'Postage stamps of Ireland Beginning on 17 February 1922, existing British stamps were overprinted with Irish text to provide some definitives until separate Irish issues became available.', 'Postage stamps of Ireland Following the overprints, a regular series of definitive stamps was produced by the new Department of Posts and Telegraphs, using domestic designs.', 'Penny Red The Penny Red was a British postage stamp, issued in 1841.', 'Penny Red It succeeded the Penny Black and continued as the main type of postage stamp in the United Kingdom of Great Britain and Ireland until 1879, with only minor changes to the design during that time.', 'Penny Red The colour was changed from black to red because of difficulty in seeing a cancellation mark on the Penny Black; a black cancel was readily visible on a Penny Red.', 'Penny Red Initially, some of the same plates that were used to print the Penny Black were used to print the Penny Red and about 21 billion Penny Reds were printed by Messrs. Perkins, Bacon & Co.'], 
        'checked_sentence_parsed': "Stamp collecting __knowledge__ It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service."
    },), 
    'checked_sentence': ["Stamp collecting __knowledge__ It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service."], 
    'know_vec': tensor([[[    0,     0,  5281,  ...,   599,     6,     2],
            [    0,     0,     0,  ...,  3251,     6,     2],
            [    0,     0,     0,  ...,   599,     6,     2],
            ...,
            [ 8730,   390,    36,  ...,   135,  1659,     2],
            [ 8730,   390,    18,  ...,    26,    12,     2],
            [ 8730,   390,  4380,  ..., 13209,    61,     2]]], device='cuda:0'), 
    'ck_mask': tensor([[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1]], device='cuda:0', dtype=torch.uint8), 
    'cs_ids': tensor([0], device='cuda:0'), 
    'use_cs_ids': False, 
    'knowledge': array([[
            "Stamp collecting __knowledge__ It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.",
            'Stamp collecting It is related to philately which is the study of stamps.',
            "Stamp collecting It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.",
            'Stamp collecting Stamp collecting proved to be an almost perfect hobby for collectors because there was a never ending stream of new stamps as each country sought to advertise its distinctiveness through its stamps.',
            'Stamp collecting Stamp collecting is generally accepted as one of the areas that make up the wider subject of philately, which is the study of stamps.',
            'Stamp collecting A philatelist may, but does not have to, collect stamps.',
            'Stamp collecting It is not uncommon for the term "philatelist" to be used to mean a stamp collector.',
            'Stamp collecting Many casual stamp collectors accumulate stamps for sheer enjoyment and relaxation without worrying about the tiny details.',
            'Stamp collecting The creation of a large or comprehensive collection, however, generally requires some philatelic knowledge and will usually contain areas of philatelic studies.',
            'Stamp collecting Postage stamps are often collected for their historical value and geographical aspects and also for the many subjects depicted on them, ranging from ships, horses, and birds to kings, queens and presidents.',
            'Popcorn Popcorn, or pop corn, is a variety of corn kernel, which forcefully expands and puffs up when heated.',
            "Popcorn A popcorn kernel's strong hull contains the seed's hard, starchy endosperm with 14-20% moisture, which turns to steam as the kernel is heated.",
            "Popcorn The pressure continues building until it exceeds the hull's ability to contain it.",
            'Popcorn The kernel ruptures and forcefully expands, allowing the contents to expand, cool, and finally set in a popcorn puff 20 to 50 times the size of the original kernel.',
            'Popcorn Some strains of corn (taxonomized as "Zea mays") are cultivated specifically as popping corns.',
            'Popcorn The "Zea mays" variety "everta," a special kind of flint corn, is the most common of these.',
            'Popcorn Time Popcorn Time is a multi-platform, free software BitTorrent client that includes an integrated media player.',
            'Popcorn Time The applications provide a free alternative to subscription-based video streaming services such as Netflix.',
            'Popcorn Time Popcorn Time uses sequential downloading to stream video listed by several torrent websites, and third party trackers can also be added manually.',
            'Popcorn Time Following its inception, Popcorn Time quickly received positive media attention, with some comparing the app to Netflix for being easy to use.',
            'Popcorn Time After this increase in popularity, the program was abruptly taken down by its original developers on March 14, 2014, due to pressure from the MPAA.',
            'Tiny but Mighty Popcorn Tiny but Mighty Popcorn is an American brand of heirloom popcorn, introduced in 1981, when Iowa farmer Richard Kelty founded K&K Popcorn.',
            'Tiny but Mighty Popcorn Iowa farmers Gene and Lynn Mealhow later purchased the company in 1999, and subsequently renamed it.',
            'Tiny but Mighty Popcorn Since 1854, the ancestors of Richard Kelty (1936-2015) had been growing a heirloom popcorn variety out of small kernels, whose hulls would disintegrate after being popped, resulting in a richer taste.',
            'Tiny but Mighty Popcorn The popcorn had been introduced to the Kelty family by Native Americans, who shared it with them.',
            'Tiny but Mighty Popcorn The Kelty family had never sold the popcorn, which was only grown for personal consumption.',
            'List of Madagascar (franchise) characters This is a list of characters that have appeared in the "Madagascar" films, the television series "The Penguins of Madagascar", and the Netflix series "All Hail King Julien".',
            'List of Madagascar (franchise) characters Tom McGrath explained in an interview that the intention of "Madagascar" was not to take a political stance on whether "zoos are bad and the wild is better, or that the wild is bad," but to show "the most extreme \'fish out of water\' story that [they] could do".',
            'List of Madagascar (franchise) characters McGrath stated "the basic irony to the story is that, you think animals do belong in the wild, but if they\'re so accustomed to civility, they wouldn\'t know where food even came from," and the animals were meant to "love the zoo and to love where they are because they\'ve got" "right off Fifth Avenue".',
            'Me² "Me²" (pronounced "me, squared") is the sixth and final episode from series one of the science fiction sitcom "Red Dwarf", which was first broadcast on BBC2 on 21 March 1988.',
            'Me² Written by Rob Grant and Doug Naylor, and directed by Ed Bye.',
            "Me² The script was written, as a late addition to the series, following an electrician's strike at the BBC.",
            'Me² The episode follows on from the cliffhanger set by "Confidence and Paranoia" - there are now two Rimmers on board "Red Dwarf".',
            "Me² The episode was remastered, along with the rest of the first three series', in 1998, to bring the episode up to a standard suitable for international broadcast.",
            'List of Bakugan Battle Brawlers characters This is a list of characters from the Japanese anime series "Bakugan Battle Brawlers".',
            'List of Bakugan Battle Brawlers characters Daniel "Dan" Kuso (known in the Japanese version as is the main human protagonist in the series, who, is 12 years old in the first season, 15 in New Vestroia, 16 in Gundalian Invaders, and 17 in Mechtanium Surge.',
            'List of Bakugan Battle Brawlers characters In the beginning he is ranked #121, and by episode 39, he is ranked #1, and has become ranked #4 or under in episode 6 of Mechtanium Surge.',
            'List of Bakugan Battle Brawlers characters In "New Vestroia", Dan returns to New Vestroia to help Drago save the world from the invading Vestals.',
            'List of Bakugan Battle Brawlers characters Despite having just been introduced to the new Brawling system, Dan manages to get the hang of it before he battles his way into the Resistance by tying with Ace.',
            'Popcorn maker A popcorn maker (also called a popcorn popper) is a machine used to pop popcorn.',
            'Popcorn maker Since ancient times, popcorn has been a popular snack food, produced through the explosive expansion of kernels of heated corn (maize).',
            'Popcorn maker Commercial large scale popcorn machines were invented by Charles Cretors in the late 19th century.',
            'Popcorn maker Many types of small scale home methods for popping corn also exist.',
            'Popcorn maker Commercial popcorn machines are commonly found in movie theaters and carnivals, producing popcorn in a pan of hot oil, which has approximately 45% of its calories derived from fat.',
            'Popcorn maker Hot air popcorn poppers appeared for home use in the late 1970s, which produce popcorn with only 5% of its calories derived from fat.',
            'Postage stamp A postage stamp is a small piece of paper that is purchased and displayed on an item of mail as evidence of payment of postage.',
            'Postage stamp Typically, stamps are printed on special custom-made paper, show a national designation and a denomination (value) on the front, and have an adhesive gum on the back or are self-adhesive.',
            'Postage stamp Postage stamps are purchased from a postal administration (post office) or other authorized vendor, and are used to pay for the costs involved in moving mail, as well as other business necessities such as insurance and registration.',
            'Postage stamp They are sometimes a source of net profit to the issuing agency, especially when sold to collectors who will not actually use them for postage.',
            'Trading stamp culture in Hong Kong Stamp collection is a common practice among retail outlets in Hong Kong.',
            'Trading stamp culture in Hong Kong The concept is to allow customers to redeem free gifts or shopping discounts after purchase.',
            'Trading stamp culture in Hong Kong The general mechanism is that stamps will be given to customers when their single purchase exceeds a certain amount of money.',
            'Trading stamp culture in Hong Kong Usually, the number of stamps given to customers is directly proportional to the money they spend on that purchase.',
            'Trading stamp culture in Hong Kong The more they spend, the more stamps they get.',
            'Trading stamp culture in Hong Kong Then, customers can stick the stamps on the collection booklet provided by the shop.',
            'Trading stamp culture in Hong Kong When they have collected certain amount of stamps, they can redeem products or chances to take part in some activities like lucky draws.',
            "Hobby A hobby is a regular activity that is done for enjoyment, typically during one's leisure time.",
            'Hobby Hobbies can include collecting themed items and objects, engaging in creative and artistic pursuits, playing sports, or pursuing other amusements.',
            'Hobby A list of hobbies is lengthy and always changing as interests and fashions change.',
            'Hobby By continually participating in a particular hobby, one can acquire substantial skills and knowledge in that area.',
            'Hobby Engagement in hobbies has increased since the late nineteenth century as workers have more leisure time and advancing production and technology have provided more support for leisure activities.',
            'Federal Duck Stamp The Federal Duck Stamp, formally known as the Migratory Bird Hunting and Conservation Stamp, is an adhesive stamp issued by the United States federal government that must be purchased prior to hunting for migratory waterfowl such as ducks and geese.',
            'Federal Duck Stamp It is also used to gain entrance to National Wildlife Refuges that normally charge for admission.',
            'Federal Duck Stamp It is widely seen as a collectable and a means to raise funds for wetland conservation, with 98% of the proceeds of each sale going to the Migratory Bird Conservation Fund.',
            'Federal Duck Stamp President Herbert Hoover signed the Migratory Bird Conservation Act in 1929 to authorize the acquisition and preservation of wetlands as waterfowl habitat.',
            'Postage stamps of Ireland The postage stamps of Ireland are issued by the postal operator of the independent Irish state.',
            "Postage stamps of Ireland Ireland was part of the United Kingdom of Great Britain and Ireland when the world's first postage stamps were issued in 1840.",
            'Postage stamps of Ireland These stamps, and all subsequent British issues, were used in Ireland until the new Irish Government assumed power in 1922.',
            'Postage stamps of Ireland Beginning on 17 February 1922, existing British stamps were overprinted with Irish text to provide some definitives until separate Irish issues became available.',
            'Postage stamps of Ireland Following the overprints, a regular series of definitive stamps was produced by the new Department of Posts and Telegraphs, using domestic designs.',
            'Penny Red The Penny Red was a British postage stamp, issued in 1841.',
            'Penny Red It succeeded the Penny Black and continued as the main type of postage stamp in the United Kingdom of Great Britain and Ireland until 1879, with only minor changes to the design during that time.',
            'Penny Red The colour was changed from black to red because of difficulty in seeing a cancellation mark on the Penny Black; a black cancel was readily visible on a Penny Red.',
            'Penny Red Initially, some of the same plates that were used to print the Penny Black were used to print the Penny Red and about 21 billion Penny Reds were printed by Messrs. Perkins, Bacon & Co.']],
        dtype='<U343')}



[chosen_topic]: Stamp collecting
[knowledge]: Stamp collecting Stamp collecting is the collecting of postage stamps and related objects.
Stamp collecting It is related to philately which is the study of stamps.
Stamp collecting It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.
Stamp collecting Stamp collecting proved to be an almost perfect hobby for collectors because there was a never ending stream of new stamps as each country sought to advertise its distinctiveness through its stamps.
Stamp collecting Stamp collecting is generally accepted as one of the areas that make up the wider subject of philately, which is the study of stamps.
Stamp collecting A philatelist may, but does not have to, collect stamps.
Stamp collecting It is not uncommon for the ...
Red Initially, some of the same plates that were used to print the Penny Black were used to print the Penny Red and about 21 billion Penny Reds were printed by Messrs. Perkins, Bacon & Co.

[title]: Stamp collecting
[checked_sentence]: It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.
[eval_labels_choice]: its actually one of the world's most popular hobbies since the late 19th century
[knowledge_parsed]:
  Stamp collecting __knowledge__ It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.
  Stamp collecting It is related to philately which is the study of stamps.
  Stamp collecting It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.
  Stamp collecting Stamp collecting proved to be an almost perfect hobby for collectors because there was a never ending stream of new stamps as each country sought to advertise its distinctiveness through its stamps.
  Stamp collecting Stamp collecting is generally accepted as one of the areas that make up the wider subject of philately, which is the study of stamps.
  ...and 69 more
[checked_sentence_parsed]: Stamp collecting __knowledge__ It has been one of the world's most popular hobbies since the late nineteenth century with the rapid growth of the postal service.
[wizard_of_wikipedia]: Stamp collecting
the hobby of stamp collecting involves collecting stamps and related objects
I have always wondered how this works... grabbing popcorn this will be good
[eval_labels: its actually one of the world's most popular hobbies since the late 19th century]
[label_candidates: THey sure our little theives they always hide stuff under the furniture.|So you are a gamer?|What fair do you go to? I love a corn dog deep fried with a thick layer of batter.|I think earl gray is the best in my opinion|I love to eat vegetarian|...and 95 more]
   [EndToEnd]: It is one of the world ' s most popular hobbies .
